Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/library.tmx
Source language: en
Languages: pl

source: Returns the current terminator for the channel.
pl: Zwraca obecne zakończenie dla kanału.

source: Pushes data on to the channel's fifo to ensure its transmission. This is all you need to do to have the channel write the data out to the network, although it is possible to use your own producers in more complex schemes to implement encryption and chunking, for example.
pl: Przepycha dane w kolejkę fifo kanału aby zapewnić jej przesyłanie. To jest wszystkim co musisz zrobić aby kanał zapisał dane na zewnątrz w sieci, chociaż jest możliwe użycie swoich własnych producentów w bardziej złożonych schematach aby wypełnić szyfrowanie lub kawałkowanie, dla przykładu.

source: Takes a producer object and adds it to the producer fifo associated with the channel. When all currently-pushed producers have been exhausted the channel will consume this producer's data by calling its :meth:`more` method and send the data to the remote endpoint.
pl: Pobiera przedmiot producenta i dodaje go do kolejki fifo producenta związanej z kanałem. Gdy wszyscy obecnie-przepychani producenci zostaną wyczerpani kanał skonsumuje dane producenta przez wezwanie swojego sposobu postępowania :meth:`more` - z ang. - :meth:`więcej` i wysłać dane do odległego drugiego końca linii.

source: Sets the terminating condition to be recognized on the channel. ``term`` may be any of three types of value, corresponding to three different ways to handle incoming protocol data.
pl: Ustawia warunek zakończenia aby był rozpoznany przez kanał. ``term`` może być dowolną z trzech typów wartości, odpowiadających trzem różnym sposobom obsługi przychodzących danych protokołu.

source: term
pl: term - z ang. - termin

source: Description
pl: Opis

source: *string*
pl: *ciąg znaków*

source: Will call :meth:`found_terminator` when the string is found in the input stream
pl: Wywoła sposób postępowania :meth:`found_terminator` gdy ciąg znaków zostanie znaleziony w strumieniu wejściowym

source: *integer*
pl: *integer* - z ang. - *liczba całkowita*

source: Will call :meth:`found_terminator` when the indicated number of characters have been received
pl: Wywoła :meth:`found_terminator` gdy wskazana liczba znaków zostanie odebrana

source: ``None``
pl: ``None`` - z ang. - ``Żaden``

source: The channel continues to collect data forever
pl: Kanał nadal zbiera dane w pętli nieskończonej

source: Note that any data following the terminator will be available for reading by the channel after :meth:`found_terminator` is called.
pl: Zauważ że dowolne dane następujące po terminatorze będą dostępne dla przeczytania przez kanał po tym jak sposób postępowania :meth:`found_terminator` zostanie wywołany.

source: asynchat - Auxiliary Classes
pl: asynchat - dodatkowe uogólnienia

source: A :class:`fifo` holding data which has been pushed by the application but not yet popped for writing to the channel. A :class:`fifo` is a list used to hold data and/or producers until they are required. If the *list* argument is provided then it should contain producers or data items to be written to the channel.
pl: Kolejka :class:`fifo` trzymająca dane które zostały popchnięte przez aplikację ale jeszcze nie pobrane do wpisania ich do kanału. Kolejka :class:`fifo` jest listą używaną do przetrzymywania danych i/lub producentów dopóki są one potrzebne. Jeśli parametr *listy* jest dostarczony wtedy powinien zawierać producentów lub elementy danych do wpisania do kanału.

source: Returns ``True`` if and only if the fifo is empty.
pl: Zwraca ``Prawdę`` - ``True`` wtedy i tylko wtedy gdy kolejka fifo jest pusta.

source: Returns the least-recently :meth:`push`\ ed item from the fifo.
pl: Zwraca najdawniej :meth:`popchnięty` - z ang - :meth:`push`\ ed element z kolejki fifo.

source: Adds the given data (which may be a string or a producer object) to the producer fifo.
pl: Dodaje podane dane (które mogą być ciągiem lub przedmiotem producenta) dla kolejki fifo producenta.

source: If the fifo is not empty, returns ``True, first()``, deleting the popped item. Returns ``False, None`` for an empty fifo.
pl: Jeśli kolejka fifo nie jest pusta, zwraca ``Prawda, pierwszy()`` - z ang. - ``True, first()``, kasując pobrany element. Zwraca ``Fałsz, Żaden`` - z ang. - ``False, None`` dla pustej kolejki fifo.

source: asynchat Example
pl: Przykład asynchat

source: The following partial example shows how HTTP requests can be read with :class:`async_chat`. A web server might create an :class:`http_request_handler` object for each incoming client connection. Notice that initially the channel terminator is set to match the blank line at the end of the HTTP headers, and a flag indicates that the headers are being read.
pl: Następujący częściowy przykład pokazuje jak zapytania HTTP mogą być wczytane za pomocą :class:`async_chat`. Serwer sieci może tworzyć przedmiot :class:`http_request_handler` - z ang. - :class:`obsluge_zapytania_http` dla każdego przychodzącego połączenia klienckiego. Zauważ że początkowo zakończenie kanału jest ustalone aby odpowiadało pustej linii na końcu nagłówka HTTP, i flaga wskazująca że nagłówki są wczytywane.

source: Once the headers have been read, if the request is of type POST (indicating that further data are present in the input stream) then the ``Content-Length:`` header is used to set a numeric terminator to read the right amount of data from the channel.
pl: Gdy już nagłówki zostaną wczytane, jeśli zapytanie jest typu POST (wskazując na to że dalsze dane są obecne w strumieniu wejściowym) wtedy nagłówek ``Content-Length:`` jest używany aby ustawić numeryczny terminator do wczytania właściwej ilości danych z kanału.

source: The :meth:`handle_request` method is called once all relevant input has been marshalled, after setting the channel terminator to ``None`` to ensure that any extraneous data sent by the web client are ignored. ::
pl: Sposób postępowania :meth:`handle_request` - z ang. - :meth:`obsloz_zapytanie` jest wywoływane gdy już całe istotne wejście zostało pobrane, po ustawieniu terminatora kanału na ``None`` - z ang. - ``Żaden`` aby upewnić się że jakiekolwiek nadmiarowe dane przesyłane przez klienta sieci są ignorowane. ::

source: class http_request_handler(asynchat.async_chat): def __init__(self, sock, addr, sessions, log): asynchat.async_chat.__init__(self, sock=sock) self.addr = addr self.sessions = sessions self.ibuffer = [] self.obuffer = b"" self.set_terminator(b"\r\n\r\n") self.reading_headers = True self.handling = False self.cgi_data = None self.log = log def collect_incoming_data(self, data): """Buffer the data""" self.ibuffer.append(data) def found_terminator(self): if self.reading_headers: self.reading_headers = False self.parse_headers("".join(self.ibuffer)) self.ibuffer = [] if self.op.upper() == b"POST": clen = self.headers.getheader("content-length") self.set_terminator(int(clen)) else: self.handling = True self.set_terminator(None) self.handle_request() elif not self.handling: self.set_terminator(None) # browsers sometimes over-send self.cgi_data = parse(self.headers, b"".join(self.ibuffer)) self.handling = True self.ibuffer = [] self.handle_request()
pl: class http_request_handler(asynchat.async_chat): def __init__(self, sock, addr, sessions, log): asynchat.async_chat.__init__(self, sock=sock) self.addr = addr self.sessions = sessions self.ibuffer = [] self.obuffer = b"" self.set_terminator(b"\r\n\r\n") self.reading_headers = True self.handling = False self.cgi_data = None self.log = log def collect_incoming_data(self, data): """Buforuj dane""" self.ibuffer.append(data) def found_terminator(self): if self.reading_headers: self.reading_headers = False self.parse_headers("".join(self.ibuffer)) self.ibuffer = [] if self.op.upper() == b"POST": clen = self.headers.getheader("content-length") self.set_terminator(int(clen)) else: self.handling = True self.set_terminator(None) self.handle_request() elif not self.handling: self.set_terminator(None) # przeglądarki czasami przesyłają zbyt dużo self.cgi_data = parse(self.headers, b"".join(self.ibuffer)) self.handling = True self.ibuffer = [] self.handle_request()

source: :mod:`asyncore` --- Asynchronous socket handler
pl: Moduł :mod:`asyncore` --- Asynchroniczna obsługa gniazda

source: This module provides the basic infrastructure for writing asynchronous socket service clients and servers.
pl: Ten moduł dostarcza podstawową infrastrukturę do pisania asynchronicznych klientów i serwerów usługi gniazd.

source: There are only two ways to have a program on a single processor do "more than one thing at a time." Multi-threaded programming is the simplest and most popular way to do it, but there is another very different technique, that lets you have nearly all the advantages of multi-threading, without actually using multiple threads. It's really only practical if your program is largely I/O bound. If your program is processor bound, then pre-emptive scheduled threads are probably what you really need. Network servers are rarely processor bound, however.
pl: Istnieją tylko dwa sposoby aby program na pojedynczym procesorze robił "więcej niż jedną rzecz na raz." Wielo-wątkowe programowanie jest najprostszą i najczęściej spotykaną drogą aby to robić, ale istnieje inna bardzo odmienna technika, która pozwala mieć prawie wszystkie zalety wielowątkowości, bez używania wielu wątków. Jest ona tylko pomocna jeśli twój program jest w większości związany z wejściem/wyjściem. Jeśli twój program jest związany z procesorem, wtedy wywłaszczające planowane wątki są najczęściej tym czego potrzebujesz. Serwery sieciowe jednakże są rzadko związane z procesorem.

source: If your operating system supports the :cfunc:`select` system call in its I/O library (and nearly all do), then you can use it to juggle multiple communication channels at once; doing other work while your I/O is taking place in the "background." Although this strategy can seem strange and complex, especially at first, it is in many ways easier to understand and control than multi-threaded programming. The :mod:`asyncore` module solves many of the difficult problems for you, making the task of building sophisticated high-performance network servers and clients a snap. For "conversational" applications and protocols the companion :mod:`asynchat` module is invaluable.
pl: Jeśli twój system operacyjny wspiera wywołanie systemowe :cfunc:`select`w swojej bibliotece wejścia/wyjścia (a prawie wszystkie wspierają), wtedy możesz używać go aby żonglować wiele kanałów komunikacji na raz; wykonywanie innych zadań gdy twoje wejście/wyjście ma miejsce w "tle". Chociaż ta strategia może wyglądać dziwnie i skomplikowanie, szczególnie na pierwszy rzut oka, jest ona na wiele sposobów łatwiejsza do zrozumienia i kontrolowania niż wielowątkowe programowanie. Moduł :mod:`asyncore` rozwiązuje wiele trudnych kłopotów za ciebie, czyniąc zadanie budowania zaawansowanych wysoko-wydajnych serwerów sieciowych i klientów oka-mgnieniem. Dla "konwersujących" aplikacji i protokołów dołączony moduł :mod:`asynchat` jest nieoceniony.

source: The basic idea behind both modules is to create one or more network *channels*, instances of class :class:`asyncore.dispatcher` and :class:`asynchat.async_chat`. Creating the channels adds them to a global map, used by the :func:`loop` function if you do not provide it with your own *map*.
pl: Podstawowym pomysłem stojącym za oboma modułami jest stworzenie jednego lub więcej *kanałów*, przykładów uogólnienia :class:`asyncore.dispatcher` i :class:`asynchat.async_chat`. Utworzenie kanałów dodaje je do globalnej mapy, używanej przez zadanie :func:`loop` jeśli dostarczysz jej swojej własnej *mapy*.

source: Once the initial channel(s) is(are) created, calling the :func:`loop` function activates channel service, which continues until the last channel (including any that have been added to the map during asynchronous service) is closed.
pl: Gdy początkowy(e) kanał(y) jest(są) tworzony(e), wywołanie zadania :func:`loop` aktywuje usługę kanału, która kontynuuje zanim ostatni kanał (włączając w to jakiekolwiek które zostały dodane do mapy podczas asynchronicznej usługi) nie zostanie zamknięty.

source: Enter a polling loop that terminates after count passes or all open channels have been closed. All arguments are optional. The *count* parameter defaults to None, resulting in the loop terminating only when all channels have been closed. The *timeout* argument sets the timeout parameter for the appropriate :func:`select` or :func:`poll` call, measured in seconds; the default is 30 seconds. The *use_poll* parameter, if true, indicates that :func:`poll` should be used in preference to :func:`select` (the default is ``False``).
pl: Wejdź w pętlę odpytywania która kończy się po przekroczeniu zliczanej liczby lub gdy wszystkie otwarte kanały zostaną zamknięte. Wszystkie parametry są opcjonalne. Domyślną wartością *count* jest None - z ang. - Żaden, powodując że pętla kończy się tylko gdy wszystkie kanały zostaną zamknięte. Parametr *timeout* ustala parametr pozostałego czasu dla wywołań zadań :func:`select` lub :func:`poll` mierzonych w sekundach: domyślna wartość to 30 sekund. Parametr *use_poll* jeśli prawdziwy, wskazuje że zadanie :func:`poll` powinno być użyte w sposób preferowany względem :func:`select` (domyślnie jest ``Fałsz``).

source: The *map* parameter is a dictionary whose items are the channels to watch. As channels are closed they are deleted from their map. If *map* is omitted, a global map is used. Channels (instances of :class:`asyncore.dispatcher`, :class:`asynchat.async_chat` and subclasses thereof) can freely be mixed in the map.
pl: Parametr *map* jest słownikiem którego elementami są kanały do oglądania. Gdy kanały są zamykane są one kasowane z ich mapy. Jeśli *mapa* jest pominięta, nadrzędna mapa jest używana. Kanały (przykłady uogólnienia :class:`asyncore.dispatcher` i :class:`asynchat.async_chat` i podrzędne uogólnienia tychże) mogą dowolnie być mieszane wewnątrz mapy.

source: The :class:`dispatcher` class is a thin wrapper around a low-level socket object. To make it more useful, it has a few methods for event-handling which are called from the asynchronous loop. Otherwise, it can be treated as a normal non-blocking socket object.
pl: Uogólnienie :class:`dispatcher` jest cienkim opakowaniem wokół niskopoziomowego przedmiotu gniazda. Aby uczynić je bardziej użytecznym, ma kilka sposobów postępowania dla obsługi-zdarzeń które są wzywane z asynchronicznej pętli. Poza tym, może być traktowana jako zwyczajny nieblokujący przedmiot gniazda.

source: The firing of low-level events at certain times or in certain connection states tells the asynchronous loop that certain higher-level events have taken place. For example, if we have asked for a socket to connect to another host, we know that the connection has been made when the socket becomes writable for the first time (at this point you know that you may write to it with the expectation of success). The implied higher-level events are:
pl: Odpalanie niskopoziomowych zdarzeń w konkretnych momentach lub w konkretnych stanach połączeń mówi pętli asynchronicznej że konkretne wyższego poziomu zdarzenia miały miejsce. Dla przykładu, jeśli żądaliśmy aby gniazdo podłączone było do innego hosta, wiemy że połączenie zostało ustanowione gdy gniazdo stanie się możliwe do zapisania po raz pierwszy (w tym momencie wiesz że możesz zapisać do niego oczekując powodzenia). Dorozumiane zdarzenia wyższego poziomu to:

source: Event
pl: Zdarzenie

source: Implied by the first read or write event
pl: Domyślne przez pierwsze zdarzenie odczytu lub zapisu

source: Implied by a read event with no data available
pl: Domyślne przy zdarzeniu odczytu bez dostępnych danych

source: Implied by a read event on a listening socket
pl: Domyślne przy zdarzeniu czytania na nasłuchującym gnieździe

source: During asynchronous processing, each mapped channel's :meth:`readable` and :meth:`writable` methods are used to determine whether the channel's socket should be added to the list of channels :cfunc:`select`\ ed or :cfunc:`poll`\ ed for read and write events.
pl: Podczas asynchronicznego przetwarzania, dla każdego mapowanego kanału sposoby postępowania :meth:`readable` i :meth:`writable` są używane, aby stwierdzić czy gniazdo danego kanału powinno być dodane do listy kanałów wybranych za pomocą zadania :cfunc:`select` lub odpytanych za pomocą zadania :cfunc:`poll` dla zdarzeń odczytu i zapisu.

source: Thus, the set of channel events is larger than the basic socket events. The full set of methods that can be overridden in your subclass follows:
pl: Dlatego, zestaw zdarzeń kanałów jest większy, niż podstawowych zdarzeń gniazda. Pełny zestaw sposobów postępowania, które mogą być przesłonięte w twoim podrzędnym uogólnieniu jest następujący:

source: Called when the asynchronous loop detects that a :meth:`read` call on the channel's socket will succeed.
pl: Wywoływane, gdy asynchroniczna pętla wykryje, że wywołanie sposobu postępowania na gnieździe kanału odniesie sukces.

source: Called when the asynchronous loop detects that a writable socket can be written. Often this method will implement the necessary buffering for performance. For example::
pl: Wywoływane, gdy asynchroniczna pętla wykryje, że możliwe do zapisu gniazdo może być zapisane. Często ten sposób postępowania będzie wypełniał konieczne wczytywanie z wyprzedzeniem dla poprawy wydajności. Dla przykładu::

source: Called when there is out of band (OOB) data for a socket connection. This will almost never happen, as OOB is tenuously supported and rarely used.
pl: Wywoływane gdy są dane poza zakresem (OOB) dla połączenia z gniazdem. To raczej nie wystąpi nigdy, jako że OOB jest rzadko wspierany i rzadziej jeszcze używany.

source: Called when the active opener's socket actually makes a connection. Might send a "welcome" banner, or initiate a protocol negotiation with the remote endpoint, for example.
pl: Wywoływane gdy gniazdo aktywnego otwierającego właściwie wywoła połączenie. Może wysłać "powitalny" banner, lub zainicjować negocjację protokołu z zewnętrznym punktem końcowym, dla przykładu.

source: Called when the socket is closed.
pl: Wywoływany gdy gniazdo jest zamykane.

source: Called when an exception is raised and not otherwise handled. The default version prints a condensed traceback.
pl: Wywoływane gdy wyjątek jest zgłaszany i nie jest inaczej obsługiwany. Domyślna wersja wypisuje skumulowany wypis.

source: Called on listening channels (passive openers) when a connection can be established with a new remote endpoint that has issued a :meth:`connect` call for the local endpoint.
pl: Wywoływany w nasłuchujących kanałach (pasywnych otwarciach) gdy połączenie może być nawiązane z nowym odległym punktem końcowym który wystosował wywołanie sposobu postępowania :meth:`connect` - z ang. - :meth:`połącz` z lokalnym punktem końcowym.

source: Called each time around the asynchronous loop to determine whether a channel's socket should be added to the list on which read events can occur. The default method simply returns ``True``, indicating that by default, all channels will be interested in read events.
pl: Wywoływane za każdym razem dla asynchronicznej pętli aby ustalić, czy gniazdo kanału powinno być dodane do listy na której zdarzenia wczytywania mogą następować. Domyślny sposób po prostu zwraca ``Prawdę`` - z ang. - ``True``, wskazując że domyślnie wszystkie kanały będą zainteresowane zdarzeniami wczytywania.

source: Called each time around the asynchronous loop to determine whether a channel's socket should be added to the list on which write events can occur. The default method simply returns ``True``, indicating that by default, all channels will be interested in write events.
pl: Wywoływane za każdym razem dla asynchronicznej pętli aby ustalić, czy gniazdo kanału powinno być dodawane do listy na której zdarzenia zapisu mogą następować. Domyślny sposób postępowania po prostu zwraca ``Prawdę`` - z ang. - ``True``, wskazując że domyślnie, wszystkie kanały będą zainteresowane zdarzeniami zapisu.

source: In addition, each channel delegates or extends many of the socket methods. Most of these are nearly identical to their socket partners.
pl: Na dodatek, każdy kanał deleguje lub rozszerza wiele ze sposobów postępowania gniazd. Większość z tych jest prawie identyczna z ich partnerami gniazda.

source: This is identical to the creation of a normal socket, and will use the same options for creation. Refer to the :mod:`socket` documentation for information on creating sockets.
pl: To jest identyczne z utworzeniem normalnego gniazda, i będzie używało tych samych opcji dla tworzenia. Zajrzyj do dokumentacji do :mod:`socket` - z ang. - :mod:`gniazda` po więcej informacji o tworzeniu gniazd.

source: As with the normal socket object, *address* is a tuple with the first element the host to connect to, and the second the port number.
pl: Tak jak z normalnymi przedmiotami gniazd, *adres* - z ang. - *address* jest krotką z pierwszym elementem hosta do którego się podłącza, i drugim numerem portu.

source: Send *data* to the remote end-point of the socket.
pl: Prześlij *dane* - z ang. - *data* do odległego punktu końcowego gniazda.

source: Read at most *buffer_size* bytes from the socket's remote end-point. An empty string implies that the channel has been closed from the other end.
pl: Wczytaj większość bajtów (kęsów) o rozmiarze *buffer_size* z odległego punktu końcowego gniazda. Pusty ciąg znaków oznacza że kanał został zamknięty z przeciwległego końca.

source: Listen for connections made to the socket. The *backlog* argument specifies the maximum number of queued connections and should be at least 1; the maximum value is system-dependent (usually 5).
pl: Nasłuchuj połączeń wykonywanych do gniazda. Parametr *wstecznego logu* - z ang. - *backlog* określa maksymalną liczbę kolejkowanych połączeń i powinien być równy przynajmniej 1; Wartość maksymalna jest zależna od systemu (zwykle jest równa 5).

source: Bind the socket to *address*. The socket must not already be bound. (The format of *address* depends on the address family --- refer to the :mod:`socket` documentation for more information.) To mark the socket as re-usable (setting the :const:`SO_REUSEADDR` option), call the :class:`dispatcher` object's :meth:`set_reuse_addr` method.
pl: Połącz gniazdo z *adresem* - z ang. - *address*. Gniazdo nie może być już połączone z adresem. (Format *adresu* - z ang. - *address* zależy od rodziny adresów --- zajrzyj do dokumentacji :mod:`socket` - z ang. - :mod:`gniazda` po więcej informacji.) Aby oznaczyć gniazdo jako możliwe do ponownego użycia - z ang. - re-usable (ustawiając opcję :const:`SO_REUSEADDR`), wywołaj sposób postępowania :meth:`set_reuse_addr` przedmiotu :class:`dispatcher`.

source: Accept a connection. The socket must be bound to an address and listening for connections. The return value is a pair ``(conn, address)`` where *conn* is a *new* socket object usable to send and receive data on the connection, and *address* is the address bound to the socket on the other end of the connection.
pl: Akceptuj połączenie. Gniazdo musi być podłączone do adresu i nasłuchiwać połączeń. Zwracana wartość jest parą ``(conn, address)`` gdzie *conn* jest *nowym* przedmiotem gniazda użytecznym do wysyłania i odbierania danych na połączeniu, i *adres* jest adresem złączonym z gniazdem do drugiego końca połączenia.
